rot_decktrans = {
    '不明妖精': '其它妖精',
    '不明死灵': '其它死灵',
    '不明皇家': '其它皇家',
    '不明龙族': '其它龙族',
    '不明主教': '其它主教',
    '不明复仇': '其它复仇者',
    '不明法师': '其它法师',
    '不明血族': '其它吸血鬼',
    '神鱼OTK龙': '神鱼龙',
    'BUFF龙': 'Buff龙',
    '送葬死': '葬送死',
    '奥义仇': '奥义鱼'
    }
ult_decktrans = {
    '不明皇家': '其它皇家',
    '命忒死': '敏特死',
    '深渊庭院龙': '深海庭院龙',
    '老虫妖': '旧虫妖',
    '自残鬼': '狂乱鬼',
    '载具妖': '速妖',
    '载具皇': '拔刀皇',
    '速死': '速攻死',
    '造物鱼': '造物仇',
    '霜糖教会教': '白骨教',
    '不明主教': '其它主教',
    '不明法师': '其它法师',
    '不明血族': '其它吸血鬼',
    '不明鱼丸': '其它复仇者',
    '不明龙族': '其它龙族',
    '中速死': '其它死灵',
    '新虫妖': '豪风虫',
    '脸皇': '其它皇家',
    '自然白骨教': '白骨教',
    '载具龙': '其它龙族',
    '不明妖精': '其它妖精',
    '不明死灵': '其它死灵',
    '人偶连携鱼': '其它复仇者',
    '连携皇': '其它皇家',
    '冥府土法': '土片法',
    '控教': '其它主教',
    '载具法': '其它法师',
    '专卖店法': '其它法师'
    }
rot_deckmerge = {
    }
ult_deckmerge = {
    }