rot_deck = {
'雪华妖': [1, 雪华, 0, 2, 阿莉雅, 0, 2],
'牛仔妖': [1, 牛仔, 0, 2],
'进化OTK皇': [2, 八爷, 0, 2, 雷给, 0, 2],
'快攻皇': [2, 八爷, 1, 0, 雷给, 0, 2, 杰诺, 0, 2],
'混沌法': [3, 混沌, 0, 2],
'半数法': [3, 安, 0, 2, 古雷亚, 0, 2],
'增幅法': [3, 露妮, 0, 2, 棱镜, 0, 2],
'载具法': [3, 大地, 0, 2],
'载具龙': [4, 雷吉, 0, 3],
'庭院龙': [4, 肥鸡, 0, 3],
'Buff龙': [4, 人鱼, 0, 3],
'神鱼龙': [4, 神鱼, 0, 3, 禁忌, 1, 0],
'进化龙': [4, 风军, 0, 2],
'快攻死': [5, 怨恨, 0, 3],
'亡语死': [5, 南瓜头, 0, 2, 刀鬼, 0, 2],
'格莫瑞死': [5, 格莫瑞, 0, 2],
'芭力鬼': [6, 芭力, 0, 3, 悖德, 0, 3],
'进化鬼': [6, 风军, 0, 2],
'碑文鬼': [6, 碑文, 0, 3],
'清净教': [7, 清净, 0, 3],
'护符教': [7, 加护神, 0, 2],
'守护教': [7, 大地魔男, 0, 2, 狐耳圣骑, 0, 2],
'教会教': [7, 教会, 0, 3],
'造物仇': [8, 工厂, 0, 2],
'奥义仇': [8, 姐姐, 0, 2, 弟弟, 0, 2]
}

unl_deck = {
}